RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_i2c.h
/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_I2C_PERIPH(periph)                           (((periph) != I2C0) && ((periph) != I2C1) && ((periph) != I2C2) && ((periph) != I2C3))

/* check the frequency division factor */
#define I2C_PSC_HIGH_VALUE                               ((uint32_t)0x0000000FU)        /*!< maximum prescaler value */
#define NOT_I2C_PSC(psc)                                 (I2C_PSC_HIGH_VALUE < (psc))

/* check data setup time */
#define SCL_DELY_HIGH_VALUE                              ((uint32_t)0x0000000FU)        /*!< maximum SCL delay value */
#define NOT_I2C_SCL_DELY(scl_dely)                       (SCL_DELY_HIGH_VALUE < (scl_dely))

/* check data hold time */
#define SDA_DELY_HIGH_VALUE                              ((uint32_t)0x0000000FU)        /*!< maximum SDA delay value */
#define NOT_I2C_SDA_DELY(sda_dely)                       (SDA_DELY_HIGH_VALUE < (sda_dely))

/* check the length of filter spikes */
#define FILTER_LENGTH_HIGH_VALUE                         ((uint32_t)0x0000000FU)        /*!< maximum filter spikes length value */
#define NOT_I2C_FILTER_LENGTH(filter_length)             (FILTER_LENGTH_HIGH_VALUE < (filter_length))

/* check SCL high period */
#define SCLH_HIGH_VALUE                                  ((uint32_t)0x000000FFU)        /*!< maximum SCL high period value */
#define NOT_I2C_SCLH(sclh)                               (SCLH_HIGH_VALUE < (sclh))

/* check SCL low period */
#define SCLL_HIGH_VALUE                                  ((uint32_t)0x000000FFU)        /*!< maximum SCL low period value */
#define NOT_I2C_SCLL(scll)                               (SCLL_HIGH_VALUE < (scll))

/* check I2C slave address */
#define ADDRESS_HIGH_VALUE                               ((uint32_t)0x000003FFU)        /*!< maximum I2C slave address value */
#define NOT_I2C_ADDRESS(address)                         (ADDRESS_HIGH_VALUE < (address))

/* check I2C transfer direction in master mode */
#define NOT_I2C_TRANS_DIRECTION(trans_direction)         (((trans_direction) != I2C_MASTER_TRANSMIT) && \
                                                          ((trans_direction) != I2C_MASTER_RECEIVE))

/* check I2C slave address mode */
#define NOT_I2C_ADDR_FORMAT(addr_format)                 (((addr_format) != I2C_ADDFORMAT_7BITS) && \
                                                          ((addr_format) != I2C_ADDFORMAT_10BITS))
/* check the bits need to compare */
#define CMOMPARE_BITS_HIGH_VALUE                         ((uint32_t)0x0000007F)         /* maximum compared value */
#define NOT_I2C_COMPARE_BITS(compare_bits)               (CMOMPARE_BITS_HIGH_VALUE < (compare_bits))

/* check I2C slave second address */
#define SECOND_ADDRESS_HIGH_VALUE                        ((uint32_t)0x000000FEU)        /*!< maximum I2C slave second address value */
#define NOT_I2C_SECOND_ADDRESS(address)                  (SECOND_ADDRESS_HIGH_VALUE < (address))

/* check the bits not need to compare */
#define NOT_I2C_ADDR_MASK(addr_mask)                     (((addr_mask) != ADDRESS2_NO_MASK) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_2) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_3) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_4) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_5) && \
                                                          ((addr_mask) != ADDRESS2_MASK_BIT1_6) && \
                                                          ((addr_mask) != ADDRESS2_MASK_ALL))

/* check the bits not need to compare */
#define NOT_I2C_DMA(dma)                                 (((dma) != I2C_DMA_TRANSMIT) && \
                                                          ((dma) != I2C_DMA_RECEIVE))

/* check bus timeout value */
#define TIMEOUT_HIGH_VALUE                               ((uint32_t)0x00000FFFU)        /*!< maximum bus timeout value */
#define NOT_I2C_TIMEOUT(timeout)                         (TIMEOUT_HIGH_VALUE < (timeout))

/* check idle clock timeout detection content */
#define NOT_I2C_TIMEOUT_DET(timeout)                     (((timeout) != BUSTOA_DETECT_SCL_LOW) && \
                                                          ((timeout) != BUSTOA_DETECT_IDLE))

/* check I2C flag status */
#define NOT_I2C_STAT_FALG(flag)                          (((flag) != I2C_FLAG_TBE) && \
                                                          ((flag) != I2C_FLAG_TI) && \
                                                          ((flag) != I2C_FLAG_RBNE) && \
                                                          ((flag) != I2C_FLAG_ADDSEND) && \
                                                          ((flag) != I2C_FLAG_NACK) && \
                                                          ((flag) != I2C_FLAG_STPDET) && \
                                                          ((flag) != I2C_FLAG_TC) && \
                                                          ((flag) != I2C_FLAG_TCR) && \
                                                          ((flag) != I2C_FLAG_BERR) && \
                                                          ((flag) != I2C_FLAG_LOSTARB) && \
                                                          ((flag) != I2C_FLAG_OUERR) && \
                                                          ((flag) != I2C_FLAG_PECERR) && \
                                                          ((flag) != I2C_FLAG_TIMEOUT) && \
                                                          ((flag) != I2C_FLAG_SMBALT) && \
                                                          ((flag) != I2C_FLAG_I2CBSY) && \
                                                          ((flag) != I2C_FLAG_TR))

/* check I2C flag(which can be cleared) status */
#define NOT_I2C_STAT_CLEAR_FALG(flag)                    (((flag) != I2C_FLAG_ADDSEND) && \
                                                          ((flag) != I2C_FLAG_NACK) && \
                                                          ((flag) != I2C_FLAG_STPDET) && \
                                                          ((flag) != I2C_FLAG_BERR) && \
                                                          ((flag) != I2C_FLAG_LOSTARB) && \
                                                          ((flag) != I2C_FLAG_OUERR) && \
                                                          ((flag) != I2C_FLAG_PECERR) && \
                                                          ((flag) != I2C_FLAG_TIMEOUT) && \
                                                          ((flag) != I2C_FLAG_SMBALT))

/* check I2C interrupt */
#define NOT_I2C_INT(interrupt)                           (((interrupt) != I2C_INT_ERR) && \
                                                          ((interrupt) != I2C_INT_TC) && \
                                                          ((interrupt) != I2C_INT_STPDET) && \
                                                          ((interrupt) != I2C_INT_NACK) && \
                                                          ((interrupt) != I2C_INT_ADDM) && \
                                                          ((interrupt) != I2C_INT_RBNE) && \
                                                          ((interrupt) != I2C_INT_TI))

#endif

/* function declarations */
/* initialization functions */
/* reset I2C */
void i2c_deinit(uint32_t i2c_periph);
/* configure the timing parameters */
void i2c_timing_config(uint32_t i2c_periph, uint32_t psc, uint32_t scl_dely, uint32_t sda_dely);
/* configure digital noise filter */
void i2c_digital_noise_filter_config(uint32_t i2c_periph, uint32_t filter_length);
/* enable analog noise filter */
void i2c_analog_noise_filter_enable(uint32_t i2c_periph);
/* disable analog noise filter */
void i2c_analog_noise_filter_disable(uint32_t i2c_periph);
/* configure the SCL high and low period of clock in master mode */
void i2c_master_clock_config(uint32_t i2c_periph, uint32_t sclh, uint32_t scll);
/* configure I2C slave address and transfer direction in master mode */
void i2c_master_addressing(uint32_t i2c_periph, uint32_t address, uint32_t trans_direction);

/* application function declarations */
/* 10-bit address header executes read direction only in master receive mode */
void i2c_address10_header_enable(uint32_t i2c_periph);
/* 10-bit address header executes complete sequence in master receive mode */
void i2c_address10_header_disable(uint32_t i2c_periph);
/* enable 10-bit addressing mode in master mode */
void i2c_address10_enable(uint32_t i2c_periph);
/* disable 10-bit addressing mode in master mode */
void i2c_address10_disable(uint32_t i2c_periph);
/* enable I2C automatic end mode in master mode */
void i2c_automatic_end_enable(uint32_t i2c_periph);
/* disable I2C automatic end mode in master mode */
void i2c_automatic_end_disable(uint32_t i2c_periph);
/* enable the response to a general call */
void i2c_slave_response_to_gcall_enable(uint32_t i2c_periph);
/* disable the response to a general call */
void i2c_slave_response_to_gcall_disable(uint32_t i2c_periph);
/* enable to stretch SCL low when data is not ready in slave mode */
void i2c_stretch_scl_low_enable(uint32_t i2c_periph);
/* disable to stretch SCL low when data is not ready in slave mode */
void i2c_stretch_scl_low_disable(uint32_t i2c_periph);
/* configure I2C slave address */
void i2c_address_config(uint32_t i2c_periph, uint32_t address, uint32_t addr_format);
/* define which bits of ADDRESS[7:1] need to compare with the incoming address byte */
void i2c_address_bit_compare_config(uint32_t i2c_periph, uint32_t compare_bits);
/* disable I2C address in slave mode */
void i2c_address_disable(uint32_t i2c_periph);
/* configure I2C second slave address */
void i2c_second_address_config(uint32_t i2c_periph, uint32_t address, uint32_t addr_mask);
/* disable I2C second address in slave mode */
void i2c_second_address_disable(uint32_t i2c_periph);
/* get received match address in slave mode */
uint32_t i2c_recevied_address_get(uint32_t i2c_periph);
/* enable slave byte control */
void i2c_slave_byte_control_enable(uint32_t i2c_periph);
/* disable slave byte control */
void i2c_slave_byte_control_disable(uint32_t i2c_periph);
/* generate a NACK in slave mode */
void i2c_nack_enable(uint32_t i2c_periph);
/* enable wakeup from deep-sleep mode */
void i2c_wakeup_from_deepsleep_enable(uint32_t i2c_periph);
/* disable wakeup from deep-sleep mode */
void i2c_wakeup_from_deepsleep_disable(uint32_t i2c_periph);
/* enable I2C */
void i2c_enable(uint32_t i2c_periph);
/* disable I2C */
void i2c_disable(uint32_t i2c_periph);
/* generate a START condition on I2C bus */
void i2c_start_on_bus(uint32_t i2c_periph);
/* generate a STOP condition on I2C bus */
void i2c_stop_on_bus(uint32_t i2c_periph);
/* I2C transmit data */
void i2c_data_transmit(uint32_t i2c_periph, uint32_t data);
/* I2C receive data */
uint32_t i2c_data_receive(uint32_t i2c_periph);
/* enable I2C reload mode */
void i2c_reload_enable(uint32_t i2c_periph);
/* disable I2C reload mode */
void i2c_reload_disable(uint32_t i2c_periph);
/* configure number of bytes to be transferred */
void i2c_transfer_byte_number_config(uint32_t i2c_periph, uint8_t byte_number);
/* enable I2C DMA for transmission or reception */
void i2c_dma_enable(uint32_t i2c_periph, uint8_t dma);
/* disable I2C DMA for transmission or reception */
void i2c_dma_disable(uint32_t i2c_periph, uint8_t dma);
/* I2C transfers PEC value */
void i2c_pec_transfer(uint32_t i2c_periph);
/* enable I2C PEC calculation */
void i2c_pec_enable(uint32_t i2c_periph);
/* disable I2C PEC calculation */
void i2c_pec_disable(uint32_t i2c_periph);
/* get packet error checking value */
uint32_t i2c_pec_value_get(uint32_t i2c_periph);
/* enable SMBus alert */
void i2c_smbus_alert_enable(uint32_t i2c_periph);
/* disable SMBus alert */
void i2c_smbus_alert_disable(uint32_t i2c_periph);
/* enable SMBus device default address */
void i2c_smbus_default_addr_enable(uint32_t i2c_periph);
/* disable SMBus device default address */
void i2c_smbus_default_addr_disable(uint32_t i2c_periph);
/* enable SMBus host address */
void i2c_smbus_host_addr_enable(uint32_t i2c_periph);
/* disable SMBus host address */
void i2c_smbus_host_addr_disable(uint32_t i2c_periph);
/* enable extended clock timeout detection */
void i2c_extented_clock_timeout_enable(uint32_t i2c_periph);
/* disable extended clock timeout detection */
void i2c_extented_clock_timeout_disable(uint32_t i2c_periph);
/* enable clock timeout detection */
void i2c_clock_timeout_enable(uint32_t i2c_periph);
/* disable clock timeout detection */
void i2c_clock_timeout_disable(uint32_t i2c_periph);
/* configure bus timeout B */
void i2c_bus_timeout_b_config(uint32_t i2c_periph, uint32_t timeout);
/* configure bus timeout A */
void i2c_bus_timeout_a_config(uint32_t i2c_periph, uint32_t timeout);
/* configure idle clock timeout detection */
void i2c_idle_clock_timeout_config(uint32_t i2c_periph, uint32_t timeout);

/* interrupt & flag functions */
/* get I2C flag status */
FlagStatus i2c_flag_get(uint32_t i2c_periph, uint32_t flag);
/* clear I2C flag status */
void i2c_flag_clear(uint32_t i2c_periph, uint32_t flag);
/* enable I2C interrupt */
void i2c_interrupt_enable(uint32_t i2c_periph, uint32_t interrupt);
/* disable I2C interrupt */
void i2c_interrupt_disable(uint32_t i2c_periph, uint32_t interrupt);
/* get I2C interrupt flag status */
FlagStatus i2c_interrupt_flag_get(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag);
/* clear I2C interrupt flag status */
void i2c_interrupt_flag_clear(uint32_t i2c_periph, i2c_interrupt_flag_enum int_flag);

#endif /* GD32H75E_I2C_H */
